9/data/attachments/89a8cf6585f89901.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Christopher_development_Friend_2534_8</nif:username>
            <nif:friendToBeRequested>soap_friends_dba243b4-fe2f-476f-b446-32680501db19</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>